## 1. Redis 字符串(String)

Redis 字符串数据类型的相关命令用于管理 redis 字符串值，基本语法如下：

### 1.1 语法

```
redis 127.0.0.1:6379> COMMAND KEY_NAME
```

### 1.2 实例

```
redis 127.0.0.1:6379> SET runoobkey redis
OK
redis 127.0.0.1:6379> GET runoobkey
"redis"
```

在以上实例中我们使用了 **SET** 和 **GET** 命令，键为 **runoobkey**。

------

## 2. Redis 字符串命令

下表列出了常用的 redis 字符串命令：

| 序号 | 命令及描述                                                   |
| :--- | :----------------------------------------------------------- |
| 1    | `SET key value`设置指定 key 的值                             |
| 2    | `GET key`获取指定 key 的值。                                 |
| 3    | `GETRANGE key start end`返回 key 中字符串值的子字符          |
| 4    | `GETSET key value`将给定 key 的值设为 value ，并返回 key 的旧值(old value)。 |
| 5    | `GETBIT key offset`对 key 所储存的字符串值，获取指定偏移量上的位(bit)。 |
| 6    | `MGET key1 [key2..]`获取所有(一个或多个)给定 key 的值。      |
| 7    | `SETBIT key offset value`对 key 所储存的字符串值，设置或清除指定偏移量上的位(bit)。 |
| 8    | `SETEX key seconds value`将值 value 关联到 key ，并将 key 的过期时间设为 seconds (以秒为单位)。 |
| 9    | `SETNX key value`只有在 key 不存在时设置 key 的值。          |
| 10   | `SETRANGE key offset value`用 value 参数覆写给定 key 所储存的字符串值，从偏移量 offset 开始。 |
| 11   | `STRLEN key`返回 key 所储存的字符串值的长度。                |
| 12   | `MSET key value [key value ...]`同时设置一个或多个 key-value 对。 |
| 13   | `MSETNX key value [key value ...]` 同时设置一个或多个 key-value 对，当且仅当所有给定 key 都不存在。 |

### 2.1 set

Redis SET 命令用于设置给定 key 的值。如果 key 已经存储其他值， SET 就覆写旧值，且无视类型。

首先，我们在 redis 中创建一个 key 并设置值。

```
# 对不存在的键进行设置
redis 127.0.0.1:6379> SET key "value"
OK

redis 127.0.0.1:6379> GET key
"value"

# 对已存在的键进行设置
redis 127.0.0.1:6379> SET key "new-value"
OK

redis 127.0.0.1:6379> GET key
"new-value"
```

### 2.2 get

Redis Get 命令用于获取指定 key 的值。如果 key 不存在，返回 nil 。如果key 储存的值不是字符串类型，返回一个错误。

```
# 对不存在的 key 或字符串类型 key 进行 GET
redis> GET db
(nil)

redis> SET db redis
OK

redis> GET db
"redis"

# 对不是字符串类型的 key 进行 GET
redis> DEL db
(integer) 1

redis> LPUSH db redis mongodb mysql
(integer) 3

redis> GET db
(error) ERR Operation against a key holding the wrong kind of value
```

### 2.3 getrange

Redis Getrange 命令用于获取存储在指定 key 中字符串的子字符串。字符串的截取范围由 start 和 end 两个偏移量决定(包括 start 和 end 在内，即全闭合)。

首先，设置 mykey 的值并截取字符串。

```
redis 127.0.0.1:6379> SET mykey "This is my test key"
OK
redis 127.0.0.1:6379> GETRANGE mykey 0 3
"This"
redis 127.0.0.1:6379> GETRANGE mykey 0 -1
"This is my test key"
```

### 2.4 getset

Redis Getset 命令用于设置指定 key 的值，并返回 key 的旧值。 当 key 没有旧值时，即 key 不存在时，返回 nil 。当 key 存在但不是字符串类型时，返回一个错误。

首先，设置 mykey 的值并截取字符串。

```
redis> GETSET db mongodb    # 没有旧值，返回 nil
(nil)

redis> GET db
"mongodb"

redis> GETSET db redis      # 返回旧值 mongodb
"mongodb"

redis> GET db
"redis"
```

### 2.5 setbit

Redis Setbit 命令用于对 key 所储存的字符串值，设置或清除指定偏移量上的位(bit)。

```
redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1

redis> GETBIT bit 100   # bit 默认被初始化为 0
(integer) 0
```

### 2.6 getbit

Redis Getbit 命令用于对 key 所储存的字符串值，获取指定偏移量上的位(bit)。当偏移量 OFFSET 比字符串值的长度大，或者 key 不存在时，返回 0 。

```
# 对不存在的 key 或者不存在的 offset 进行 GETBIT， 返回 0
redis> EXISTS bit
(integer) 0

redis> GETBIT bit 10086
(integer) 0

# 对已存在的 offset 进行 GETBIT
redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1
```

### 2.7 strlen

Redis Strlen 命令用于获取指定 key 所储存的字符串值的长度。当 key 储存的不是字符串值时，返回一个错误。当 key 不存在时，返回 0。

```
# 获取字符串的长度
redis> SET mykey "Hello world"
OK

redis> STRLEN mykey
(integer) 11

# 不存在的 key 长度为 0
redis> STRLEN nonexisting
(integer) 0
```

### 2.8 mset

Redis Mset 命令用于同时设置一个或多个 key-value 对。

```
redis 127.0.0.1:6379> MSET key1 "Hello" key2 "World"
OK
redis 127.0.0.1:6379> GET key1
"Hello"
redis 127.0.0.1:6379> GET key2
 "World"
```

### 2.9 setnx

Redis Setnx（**SET** if **N**ot e**X**ists） 命令在指定的 key 不存在时，为 key 设置指定的值。

设置成功，返回 1 。 设置失败，返回 0 。

```
redis> EXISTS job                # job 不存在
(integer) 0

redis> SETNX job "programmer"    # job 设置成功
(integer) 1

redis> SETNX job "code-farmer"   # 尝试覆盖 job ，失败
(integer) 0

redis> GET job                   # 没有被覆盖
"programmer"
```

### 3.0 msetnx

Redis Msetnx 命令用于所有给定 key 都不存在时，同时设置一个或多个 key-value 对。

当所有 key 都成功设置，返回 1 。 如果所有给定 key 都设置失败(至少有一个 key 已经存在)，那么返回 0 。

```
# 对不存在的 key 进行 MSETNX
redis> MSETNX rmdbs "MySQL" nosql "MongoDB" key-value-store "redis"
(integer) 1

redis> MGET rmdbs nosql key-value-store
1) "MySQL"
2) "MongoDB"
3) "redis"

# MSET 的给定 key 当中有已存在的 key
redis> MSETNX rmdbs "Sqlite" language "python"  # rmdbs 键已经存在，操作失败
(integer) 0

redis> EXISTS language                          # 因为 MSET 是原子性操作，language 没有被设置
(integer) 0

redis> GET rmdbs                                # rmdbs 也没有被修改
"MySQL"
```

