## 1. Redis 哈希(Hash)

Redis hash 是一个 string 类型的 field（字段） 和 value（值） 的映射表，hash 特别适合用于存储对象。

Redis 中每个 hash 可以存储 232 - 1 键值对（40多亿）。

### 1.1 实例

```
127.0.0.1:6379>  HMSET runoobkey name "redis tutorial" description "redis basic commands for caching" likes 20 visitors 23000
OK
127.0.0.1:6379>  HGETALL runoobkey
1) "name"
2) "redis tutorial"
3) "description"
4) "redis basic commands for caching"
5) "likes"
6) "20"
7) "visitors"
8) "23000"
```

在以上实例中，我们设置了 redis 的一些描述信息(name, description, likes, visitors) 到哈希表的 **runoobkey** 中。

------

## 2. Redis hash 命令

下表列出了 redis hash 基本的相关命令：

| 序号 | 命令及描述                                                   |
| :--- | :----------------------------------------------------------- |
| 1    | `HDEL key field1 [field2...]`删除一个或多个哈希表字段        |
| 2    | `HEXISTS key field`查看哈希表 key 中，指定的字段是否存在。   |
| 3    | `HGET key field`获取存储在哈希表中指定字段的值。             |
| 4    | `HGETALL key`获取在哈希表中指定 key 的所有字段和值           |
| 5    | `HKEYS key`获取所有哈希表中的字段                            |
| 6    | `HLEN key`获取哈希表中字段的数量                             |
| 7    | `HMGET key field1 [field2...]`获取所有给定字段的值           |
| 8    | `HMSET key field1 value1 [field2 value2...]`同时将多个 field-value (域-值)对设置到哈希表 key 中。 |
| 9    | `HSET key field value`将哈希表 key 中的字段 field 的值设为 value 。 |
| 10   | `HSETNX key field value`只有在字段 field 不存在时，设置哈希表字段的值。 |
| 11   | `HVALS key` 获取哈希表中所有值。                             |

### 2.1 hdel

Redis Hdel 命令用于删除哈希表 key 中的一个或多个指定字段，不存在的字段将被忽略。

```
redis 127.0.0.1:6379> HSET myhash field1 "foo"
(integer) 1
redis 127.0.0.1:6379> HDEL myhash field1
(integer) 1
redis 127.0.0.1:6379> HDEL myhash field2
(integer) 0
```

### 2.2 hexists

Redis Hexists 命令用于查看哈希表的指定字段是否存在。

如果哈希表含有给定字段，返回 1 。 如果哈希表不含有给定字段，或 key 不存在，返回 0 。

```
redis 127.0.0.1:6379> HSET myhash field1 "foo"
(integer) 1
redis 127.0.0.1:6379> HEXISTS myhash field1
(integer) 1
redis 127.0.0.1:6379> HEXISTS myhash field2
(integer) 0
```

### 2.3 hset

设置某个字段的值

```
redis> HSET site redis redis.com
(integer) 1
```

### 2.4 hget

Redis Hget 命令用于返回哈希表中指定字段的值。

返回给定字段的值。如果给定的字段或 key 不存在时，返回 nil 。

```
# 字段存在
redis> HSET site redis redis.com
(integer) 1

redis> HGET site redis
"redis.com"

# 字段不存在
redis> HGET site mysql
(nil)
```

### 2.5 hgetall

Redis Hgetall 命令用于返回哈希表中，所有的字段和值。在返回值里，紧跟每个字段名(field name)之后是字段的值(value)，所以返回值的长度是哈希表大小的两倍。

以列表形式返回哈希表的字段及字段值。 若 key 不存在，返回空列表。

```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HGETALL myhash
1) "field1"
2) "Hello"
3) "field2"
4) "World"
redis> 
```

### 2.6 hkeys

Redis Hkeys 命令用于获取哈希表中的所有域（field）。

包含哈希表中所有域（field）列表。 当 key 不存在时，返回一个空列表。

```
redis 127.0.0.1:6379> HSET myhash field1 "foo"
(integer) 1
redis 127.0.0.1:6379> HSET myhash field2 "bar"
(integer) 1
redis 127.0.0.1:6379> HKEYS myhash
1) "field1"
2) "field2"
```

### 2.7 hvals

Redis Hvals 命令返回哈希表所有域(field)的值。

```
redis 127.0.0.1:6379> HSET myhash field1 "foo"
(integer) 1
redis 127.0.0.1:6379> HSET myhash field2 "bar"
(integer) 1
redis 127.0.0.1:6379> HVALS myhash
1) "foo"
2) "bar"

# 空哈希表/不存在的key
redis 127.0.0.1:6379> EXISTS not_exists
(integer) 0

redis 127.0.0.1:6379> HVALS not_exists
(empty list or set)
```

### 2.8 hlen

Redis Hlen 命令用于获取哈希表中字段的数量。当 key 不存在时，返回 0 。

```
redis 127.0.0.1:6379> HSET myhash field1 "foo"
(integer) 1
redis 127.0.0.1:6379> HSET myhash field2 "bar"
(integer) 1
redis 127.0.0.1:6379> HLEN myhash
(integer) 2
```

### 2.9 hmget

Redis Hmget 命令用于返回哈希表中，一个或多个给定字段的值。如果指定的字段不存在于哈希表，那么返回一个 nil 值。

一个包含多个给定字段关联值的表，表值的排列顺序和指定字段的请求顺序一样。

```
redis 127.0.0.1:6379> HSET myhash field1 "foo"
(integer) 1
redis 127.0.0.1:6379> HSET myhash field2 "bar"
(integer) 1
redis 127.0.0.1:6379> HMGET myhash field1 field2 nofield
1) "foo"
2) "bar"
3) (nil)
```

### 3.0 hmset

Redis Hmset 命令用于同时将多个 field-value (字段-值)对设置到哈希表中。此命令会覆盖哈希表中已存在的字段。

如果哈希表不存在，会创建一个空哈希表，并执行 HMSET 操作。

```
redis 127.0.0.1:6379> HMSET myhash field1 "Hello" field2 "World"
OK
redis 127.0.0.1:6379> HGET myhash field1
"Hello"
redis 127.0.0.1:6379> HGET myhash field2
"World"
```